<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" 
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

	<head>
		<title>Open Source</title>
		<!-- metadata -->
		<meta name="generator" content="S5" />
		<meta name="version" content="S5 1.1" />
		<meta name="presdate" content="20091114" />
		<meta name="author" content="Dirk Deimeke und Roman Hanhart" />
		<meta name="company" content="DeimHart: Das klingt gut ..." />
		<!-- configuration parameters -->
		<meta name="defaultView" content="slideshow" />
		<meta name="controlVis" content="hidden" />
		<!-- style sheet links -->
		<link rel="stylesheet" href="ui/default/slides.css" type="text/css" media="projection" id="slideProj" />
		<link rel="stylesheet" href="ui/default/outline.css" type="text/css" media="screen" id="outlineStyle" />
		<link rel="stylesheet" href="ui/default/print.css" type="text/css" media="print" id="slidePrint" />
		<link rel="stylesheet" href="ui/default/opera.css" type="text/css" media="projection" id="operaFix" />
		<!-- embedded styles -->
		<style type="text/css" media="all">
			.imgcon {width: 525px; margin: 0 auto; padding: 0; text-align: center;}
			#anim {width: 270px; height: 320px; position: relative; margin-top: 0.5em;}
			#anim img {position: absolute; top: 42px; left: 24px;}
			img#me01 {top: 0; left: 0;}
			img#me02 {left: 23px;}
			img#me04 {top: 44px;}
			img#me05 {top: 43px;left: 36px;}
		</style>
		<!-- S5 JS -->
		<script src="ui/default/slides.js" type="text/javascript"></script>
	</head>
	<body>

		<div class="layout">
			<div id="controls"><!-- DO NOT EDIT --></div>
			<div id="currentSlide"><!-- DO NOT EDIT --></div>
			<div id="header"></div>
			<div id="footer">
				<h1>Open Source</h1>
				<h2>Barcamp Liechtenstein &#8226; 14. November 2009</h2>
			</div>
		</div>
		
		<div class="presentation">

			<div class="slide">
				<!-- <h1>Open Source</h1> -->
				<img src="opensource.png" />
				<h3>Dirk Deimeke und Roman Hanhart</h3>
				<h4><a href="http://deimhart.net/" rel="external">DeimHart: Das klingt gut ...</a></h4>
			</div>

			<div class="slide">
				<h1>Inhalt</h1>
				<!-- <ul class="incremental"> -->
				<ul>
					<li>Was ist OpenSourceSoftware?</li>
					<li>Einige Lizenzmodelle dazu</li>
					<li>Die einfachste OpenSource-Lizenz</li>
					<li>ClosedSource</li>
					<li>Folgerungen</li>
				</ul>
			</div>

			<div class="slide">
				<h1>Was ist OpenSourceSoftware?</h1>
				<ul>
					<li>Open Source bedeutet zu Deutsch quelloffen und ist eine Palette von Lizenzen f&uuml;r Software, deren Quelltext &ouml;ffentlich zug&auml;nglich ist und durch die Lizenz Weiterentwicklungen f&ouml;rdert.</li>
					<li>Open-Source-Software steht unter einer von der Open Source Initiative (OSI) anerkannten Lizenz.</li>
					<li>Die Software (das heisst der Quelltext) liegt in einer f&uuml;r den Menschen lesbaren und verst&auml;ndlichen Form vor.</li>
					<li>Die Software darf beliebig kopiert, verbreitet und genutzt werden.</li>
					<li>Die Software darf ver&auml;ndert und in der ver&auml;nderten Form weitergegeben werden.</li> 
				</ul>
			</div>

			<div class="slide">
				<h1>Einige Lizenzmodelle dazu</h1>
				<ul>
					<li>Netscape entschied im Jahre 1998 angesichts der wachsenden Dominanz von Microsoft am Browser-Markt, den Quelltext des wirtschaftlich nicht mehr verwertbaren Netscape Navigators freizugeben. Aus dieser Freigabe entstand sp&auml;ter das Mozilla-Projekt.</li>
					<li>Eine der bekanntesten Lizenzen, die aus diesen Bestrebungen hervorging, ist die Mozilla Public License</li>
					<li>Weitere Lizenzformen</li>
					<ul>
						<li>Creative Commons (CC)</li>
						<li>Apache Software License</li>
						<li>General Public License (GPL)</li>
					</ul>
				</ul>
			</div>

			<div class="slide">
				<h1>Einfachste OpenSource-Lizenz</h1>
				<ul>
					<li>Die BSD Lizenz ist die wohl einfachste OpenSource-Lizenz, sie besteht nur aus zwei S&auml;tzen.</li>
					<ul>
						<li>Gib nicht vor den Code geschrieben zu haben.</li>
						<li>Verklage mich nicht, wenn etwas nicht funktioniert.</li>
					</ul>
				</ul>
			</div>

			<div class="slide">
				<h1>ClosedSource</h1>
				<ul>
					<li>Quellcode liegt nur in bin&auml;rer Form vor und ist von Menschen nicht lesbar</li>
					<li>Quellcode kann nicht ver&auml;ndert werden, ist meist geheim</li>
					<li>Der Code ist Eigentum einer juristischen oder nat&uuml;rlichen Person.</li>
					<li>Meist darf die Software nicht weitergegeben werden</li>
					<ul>
						<li>Zwischen Freeware und OpenSourceSoftware besteht ein Unterschied</li>
						<li>Zwischen Public Domain Software und OpenSourceSoftware besteht ein Unterschied</li>
					</ul>
					<li>Oft kostenpflichtig</li>
				</ul>
			</div>

			<div class="slide">
				<h1>Folgerungen</h1>
				<ul>
					<li>Investitionsschutz</li>
					<li>Zukunftssicherheit</li>
					<li>Plattformunabh&auml;ngigkeit</li>
				</ul>
			</div>
		</div>

			<div class="slide">
				<h1>Erl&auml;uterung</h1>
				<ul>
					<li>Software ist so wie sie ist funktionst&uuml;chtig und muss nicht aufgrund von Herstellervorgaben oder um weiterhin Support zu erhalten, aktualisiert werden.</li>
					<ul>
						<li>Beispielsweise unterst&uuml;tzt der Hersteller einer Software nur noch das aktuelle Betriebssystem eines anderen Herstellers.</li>
					</ul>
					<li>Selbst, wenn man selber nicht programmieren kann, kann man die Features, die man haben m&ouml;chte - auch gegen Bezahlung - in Auftrag geben.</li>
					<ul>
						<li>Features werden f&uuml;r ClosedSourceSoftware nach wirtschaftlichen Gesichtspunkten implementiert, da haben Minderheiten keine Chance.</li>
						<li>Wenn eine ClosedSourceSoftware abgek&uuml;ndigt wird, muss man migrieren.</li>
						<li>Bei Abk&uuml;ndigung von OpenSourceSoftware besteht die M&ouml;glichkeit, sie durch andere weiterentwickeln zu lassen.</li>
					</ul>
				</ul>
			</div>

			<div class="slide">
				<h1>Erl&auml;uterung (Fortsetzung)</h1>
				<ul>
					<li>Ein Wechsel der Software-Plattform l&auml;sst sich mit Einsatz von OpenSourceSoftware leichter bewerkstelligen</li>
					<ul>
						<li>Nutzung der gleichen Software, unabh&auml;ngig vom Betriebssystem.</li>
						<li>Wichtiger: Nutzung der gleichen <strong>Daten</strong>, unabh&auml;ngig vom Betriebssystem.</li>
						<li>Wechsel von Windows nach Mac OS X und Linux (und zur&uuml;ck) sind m&ouml;glich.
						<li>Die Lernkurve beim Wechsel der Plattform wird flacher und damit werden auch weniger Schulungen ben&ouml;tigt.</li>
					</ul>
				</ul>
			</div>

			<div class="slide">
				<h1>Demo</h1>
				<ul>
					<li>Wir haben ein paar Programme aus dem sehr grossen OpenSource-Universum herausgesucht, die auf mehreren Plattformen laufen und Datenaustausch erlauben.
				</ul>
			</div>

	</body>

</html>
